lib/tasks/export.rake

SELECT "yazilars".* FROM "yazilars" ORDER BY "yazilars"."id" ASC
---
  task :seeds_format => :environment do
    Yazilar.order(:id).all.each do |yazi|