app/controllers/admin_controller.rb

  def new
    @yazilar = Yazilar.new(status: '0')
    @yazilar_count = Yazilar.count + 1
---
SELECT COUNT(*) FROM "yazilars"

  def create
    @yazilar = Yazilar.new(subject_params)
    if @yazilar.save
      flash[:notice] = 'Yazi basariyla olusturuldu.'
      redirect_to(action: 'index')
    else
      @yazilar_count = Yazilar.count
---
INSERT INTO "yazilars" ("title", "body", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT COUNT(*) FROM "yazilars"

  def edit
    @article = Yazilar.find(params[:id])
---
SELECT  "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def update
          @article = Yazilar.find(params[:id])
---
SELECT "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def show
    @posts = Yazilar.find(params[:id])
---
SELECT "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def delete
    @posts = Yazilar.find(params[:id])
---
SELECT "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    silinecek_yazi = Yazilar.find(params[:id])
    silinecek_yazi.destroy
---
SELECT "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "yazilars" WHERE "yazilars"."id" = $1  [["id", 2]]

  def kullanicilar
    @user = User.order('id DESC')
---
SELECT "users".* FROM "users" ORDER BY id DESC

  def yazilar
    @posts = Yazilar.order('id DESC')
---
SELECT "yazilars".* FROM "yazilars" ORDER BY id DESC