app/controllers/index_controller.rb

  def index
    @posts = Yazilar.all
---
SELECT "yazilars".* FROM "yazilars"