app/controllers/yazilar_controller.rb

SELECT "yazilars".* FROM "yazilars" ORDER BY id DESC
---
  def index
    @posts = Yazilar.order('id DESC')

SELECT "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @posts = Yazilar.find(params[:id])

SELECT "yazilars".* FROM "yazilars" WHERE "yazilars"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @yazi = Yazilar.find(params[:id])